In [2]:
import pandas as pd

In [6]:
data1 = {"Name":["Taro","Hanako","Jiro"],
        "Age":[12,45,31]}
df1 = pd.DataFrame(data1)
df1

     Name  Age
0    Taro   12
1  Hanako   45
2    Jiro   31

In [7]:
df1.head(2)

     Name  Age
0    Taro   12
1  Hanako   45

In [9]:
data2= {"Address":["東京","大阪","沖縄"]}
df2= pd.DataFrame(data2)
df2

  Address
0      東京
1      大阪
2      沖縄

In [10]:
df3 = pd.concat([df1,df2])
df3

     Name   Age Address
0    Taro  12.0     NaN
1  Hanako  45.0     NaN
2    Jiro  31.0     NaN
0     NaN   NaN      東京
1     NaN   NaN      大阪
2     NaN   NaN      沖縄

In [11]:
df4 =pd.concat([df1,df2],axis=1)
df4

     Name  Age Address
0    Taro   12      東京
1  Hanako   45      大阪
2    Jiro   31      沖縄